In [1]:
import pandas as pd

## Year 2021

### Drop-out Data

https://www.isbe.net/_layouts/Download.aspx?SourceUrl=/Documents/2021-RC-Pub-Data-Set.xlsx

In [2]:
data = pd.read_csv('enr21.csv')
data = data[data['Type'] == 'School']

/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (766,767,780,781,794,795,808,809,816,817,822,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,842,843) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
col_name = ['RCDTS', '# Student Enrollment', 
            '% Student Enrollment - White', 
            '% Student Enrollment - Black or African American', 
            '% Student Enrollment - Hispanic or Latino',
           '% Student Enrollment - Low Income',
           'High School Dropout Rate - Total']

In [4]:
demo = data.loc[((data['# Student Enrollment'] > 0) 
                 & (data['High School Dropout Rate - Total'].notnull())), col_name].rename(
    columns = {'RCDTS':'schoolcode', '# Student Enrollment':'totalenrolled', 
              '% Student Enrollment - White':'white',
              '% Student Enrollment - Black or African American':'black',
              '% Student Enrollment - Hispanic or Latino':'hispanic',
              '% Student Enrollment - Low Income':'lowincome',
              'High School Dropout Rate - Total':'dropout'}).fillna(0)

demo.loc[:, ['white', 'black', 'hispanic', 'lowincome', 'dropout']] = round(demo.loc[:, 
['white', 'black', 'hispanic', 'lowincome', 'dropout']], 2)

demo.head()

         schoolcode  totalenrolled  white  black  hispanic  lowincome  dropout
1   010010010260001            241   96.3    0.0       0.0       36.9      4.6
4   010010020260001            270   95.2    0.0       0.0       22.2      2.2
7   010010030260001            257   96.9    0.0       0.0       39.3      2.7
12  010010040260001            176   96.6    0.0       0.0       34.7      3.4
16  010011720220003           1852   79.9    6.9       3.3       46.1      5.5

In [23]:
drop21 = demo
drop21['year'] = '2021'

## Year 2019

https://www.isbe.net/_layouts/Download.aspx?SourceUrl=/Documents/2019-Report-Card-Public-Data-Set.xlsx

### Drop-out Data

In [24]:
data = pd.read_csv('enr19.csv')
data = data[data['Type'] == 'School']

/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (2,8,9,10,11,12,773,774,787,788,801,802,815,816,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,843,844,845,846,847,848,849,850) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [25]:
col_name = ['RCDTS', '# Student Enrollment', 
            '% Student Enrollment - White', 
            '% Student Enrollment - Black or African American', 
            '% Student Enrollment - Hispanic or Latino',
           '% Student Enrollment - Low Income',
           'High School Dropout Rate - Total']

In [26]:
demo = data.loc[((data['# Student Enrollment'] > 0) 
                 & (data['High School Dropout Rate - Total'].notnull())), col_name].rename(
    columns = {'RCDTS':'schoolcode', '# Student Enrollment':'totalenrolled', 
              '% Student Enrollment - White':'white',
              '% Student Enrollment - Black or African American':'black',
              '% Student Enrollment - Hispanic or Latino':'hispanic',
              '% Student Enrollment - Low Income':'lowincome',
              'High School Dropout Rate - Total':'dropout'}).fillna(0)

demo.loc[:, ['white', 'black', 'hispanic', 'lowincome', 'dropout']] = round(demo.loc[:, 
['white', 'black', 'hispanic', 'lowincome', 'dropout']], 2)

demo.head()

         schoolcode  totalenrolled  white  black  hispanic  lowincome  dropout
0   010010010260001            239   95.4    0.0       0.4       46.4      0.6
2   010010020260001            288   97.6    0.3       0.0       20.5      3.0
4   010010030260001            237   98.3    0.0       0.0       42.2      3.7
8   010010040260001            200   98.5    0.0       1.0       34.0      1.5
11  010011720220003           1742   81.7    6.7       3.5       48.7      2.4

In [27]:
drop19 = demo
drop19['year'] = '2019'

## Year 2018

https://www.isbe.net/_layouts/Download.aspx?SourceUrl=/Documents/Report-Card-Public-Data-Set.xlsx

### Drop-out Data

In [28]:
data = pd.read_csv('enr18.csv')
data = data[data['Type'] == 'School']

/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [29]:
col_name = ['RCDTS', 'Student Enrollment - Total', 
            'Student Enrollment - White %', 
            'Student Enrollment - Black or African American %', 
            'Student Enrollment - Hispanic or Latino %',
           'Student Enrollment - Low Income %',
           'High School Dropout Rate - Total']

In [30]:
demo = data.loc[data['Student Enrollment - Total'] > 0, col_name].rename(
    columns = {'RCDTS':'schoolcode', 'Student Enrollment - Total':'totalenrolled', 
              'Student Enrollment - White %':'white',
              'Student Enrollment - Black or African American %':'black',
              'Student Enrollment - Hispanic or Latino %':'hispanic',
              'Student Enrollment - Low Income %':'lowincome',
              'High School Dropout Rate - Total':'dropout'}).fillna(0)

demo.loc[:, ['white', 'black', 'hispanic', 'lowincome', 'dropout']] = round(demo.loc[:, 
['white', 'black', 'hispanic', 'lowincome', 'dropout']], 2)

demo.head()

       schoolcode  totalenrolled  white  black  hispanic  lowincome  dropout
1  10010010260001          246.0   96.7    0.0       0.0       43.9      0.0
2  10010010262002          311.0   93.9    0.0       0.0       52.7      0.0
4  10010020260001          281.0   98.6    0.0       0.0       22.4      0.5
5  10010020262002          318.0   96.9    0.0       0.0       26.7      0.0
7  10010030260001          245.0   96.3    0.0       0.0       42.0      1.2

In [32]:
drop18 = demo
        
for i in list(drop18.schoolcode):
    if len(str(i)) != 15:
        drop18.loc[drop18.schoolcode == i, 'schoolcode'] = '0' + str(i)
        
drop18.schoolcode = drop18.schoolcode.astype('str')

drop18['year'] = '2018'

## Year 2017

https://www.isbe.net/_layouts/Download.aspx?SourceUrl=/Documents/2017_PARCC_SAT_ACT_enrollment.xlsx

### Drop-out Data

In [44]:
demo = pd.read_csv('enr17.csv')
demo = demo.loc[demo['dropout']!='     ', :]

drop17 = demo
drop17['year'] = '2017'

## Merge Data (2017 - 2021)

In [46]:
mutual_school = list(set(drop17.schoolcode).intersection(set(drop18.schoolcode)).intersection(
    set(drop19.schoolcode)).intersection(set(drop21.schoolcode)))

mutual_drop17 = drop17.loc[drop17['schoolcode'].isin(mutual_school)]
mutual_drop18 = drop18.loc[drop18['schoolcode'].isin(mutual_school)]
mutual_drop19 = drop19.loc[drop19['schoolcode'].isin(mutual_school)]
mutual_drop21 = drop21.loc[drop21['schoolcode'].isin(mutual_school)]

In [48]:
all_year = pd.concat([mutual_drop17,mutual_drop18,mutual_drop19,mutual_drop21])
all_year['totalenrolled'] = all_year['totalenrolled'].astype('int')

all_year.to_csv('dropout_il_17_21.csv')

### Pandemic Instruction Modality Data

In [5]:
mode = pd.read_csv('schoolmode_il.csv')

In [6]:
charter_mode = mode.loc[:, ['StateAssignedSchoolID', 'Charter']].drop_duplicates().rename(columns = {'StateAssignedSchoolID':
             'schoolcode', 'Charter':'charter'})
charter_map = {'No':0, 'Yes':1}
charter_mode['charter'] = charter_mode['charter'].map(charter_map)
charter_mode.head()

         schoolcode  charter
0    80432100260002        0
11   80432100261001        0
22   80432100262003        0
33  11012004C260001        0
44  11012004C262003        0

In [6]:
mode = mode[mode['LearningModel']!='Closed']

il_mode = mode.groupby(['StateAssignedSchoolID', 'NCESSchoolID'])['LearningModel'].value_counts(
    normalize = True).to_frame().rename(columns = {'LearningModel':'normalized'}).reset_index().rename(
columns = {'StateAssignedSchoolID':'schoolcode'})

il_mode = il_mode.pivot(columns = 'LearningModel', values = 'normalized', 
index = ['schoolcode','NCESSchoolID']).reset_index().fillna(0).loc[:, 
        ['schoolcode', 'NCESSchoolID', 'Hybrid', 'Virtual', 'In-person']].rename(
columns = {'Hybrid':'hybridper', 'Virtual':'virtualper', 'In-person':'inpersonper'})

il_mode['schoolmode'] = 1 * il_mode['virtualper'] + 0.5 * il_mode['hybridper']

il_mode.loc[:, ['hybridper', 'virtualper', 'inpersonper', 'schoolmode']] = round(
    il_mode.loc[:, ['hybridper', 'virtualper', 'inpersonper', 'schoolmode']], 2)

il_mode = il_mode.merge(charter_mode, on = 'schoolcode')

for i in list(il_mode.schoolcode):
    if len(str(i)) != 15:
        il_mode.loc[il_mode.schoolcode == i, 'schoolcode'] = '0' + str(i)
        
il_mode['schoolcode'] = il_mode['schoolcode'].astype('str')

il_mode.head()

,schoolcode,NCESSchoolID,hybridper,virtualper,inpersonper,schoolmode,charter
0,04101205025201C,173451006077,0.00,0.00,1.00,0.00,1
1,04101205025202C,173451006044,0.18,0.09,0.73,0.18,1
2,04101205025203C,173451006154,0.00,0.00,1.00,0.00,1
3,07016113A021002,170729001933,0.70,0.00,0.30,0.35,0
4,07016113A022002,170729002507,0.50,0.20,0.30,0.45,0

In [8]:
drop_mode = pd.read_csv('dropout_il_17_21.csv').iloc[:, 1:].merge(il_mode, 
on = 'schoolcode')

drop_mode['countycode'] = drop_mode['schoolcode'].apply(lambda x: x[:4]) + 'il'
drop_mode['districtcode'] = drop_mode['schoolcode'].apply(lambda x: x[:-4]) + 'il'
drop_mode['state'] = 'il'

drop_mode.year = drop_mode.year.astype('str')

drop_mode.loc[drop_mode['year'] != '2021', ['hybridper', 'virtualper', 'schoolmode']] = 0
drop_mode.loc[drop_mode['year'] != '2021', ['inpersonper']] = 1
drop_mode['year_21'] = 1
drop_mode.loc[drop_mode['year'] != '2021', 'year_21'] = 0

il = drop_mode.iloc[:, 1:].rename(columns = {'schoolcode':'mergecode', 'totalenrolled':'totalenroll',
              'dropout':'droprate'}).drop(columns = 'countycode')
il['year'] = il['year'].map({2017:'17', 2018:'18', 2019:'19', 2021:'21'})
il.set_index('year').to_csv('illinois_dropout.csv')